package quiz;
/*
	1. 게임이 시작되면 꽝 자리가 정해진다
	
	2. 플레이어는 아저씨가 튀어나올때까지 돌아가면서 계속 자리를 선택해야한다
		(플레이어는 4명으로 고정한다)
	
	3. 칼로 찌를 수 있는 홈은 20개가 있고 그 중 4개가 꽝이 된다
	(꽝의 위치는 매 판 시작시 랜덤으로 설정된다)
	
	4. 아저씨가 발사되면 해당 플레이어의 점수를 깎고 나머지의 점수를 
	찌르는데 성공한 횟수에 비례하여 증가시킨다
	
	5. 게임을 그만하겠다고 할 시 모든 플레이어의 최종 점수와 순위를 출력해준다
	순위에 따라 소지금이 변경된다(1위 +1000 2위 +500)
	3위 -500 4위 -1000)
	6. 각 플레이어는 이름 점수 소지금이 있다.
	
	7. 게임을 그만두겠다고 하거나 또는 한 사람의 소지금이 -가 된다면 게임이 종료된다
	   게임이 종료되면서 최종 스코어를 출력해준다
	   (이름, 점수, 남은 소지금(+얼마 벌었나) 등)
*/

public class C05_PirateGame {

	public static void main(String[] args) {
		
		String name1 = "철수", name2 = "영희" , name3 = "민수" , name4= "영자";
		
		
	}
			
}

